import "./typo.css";

export function WichakanCite1() {
  return (
    <div>
      <p className="text-base">
        ข้อย่อยที่ 1 <span className="text-red-500">( 8 คะแนน )</span>
      </p>
      <ul>
        <li>
          การออกแบบวิธีการแก้ไขปัญหา{" "}
          <span className="text-red-500">( 4 คะแนน )</span>{" "}
        </li>
        <ul>
          <li className="text-red-500">0 - 1 คะแนน</li>
          <ul>
            <li>
              วิธีการคิดไม่มีคำอธิบายที่ชัดเจนว่ามีระดับขั้นตอนการทำงานอย่างไรบ้าง
            </li>
            <li>ขาดโครงสร้างในการอธิบายการคิดเป็นลำดับขั้นตอน</li>
          </ul>
          <li>
            <span className="text-red-500">2 คะแนน</span>
          </li>
          <ul>
            <li>
              มีการร่างแนวทางการแก้ปัญหาแบบเป็นขั้นตอนแต่ไม่สมบูรณ์ตามเนื้อหาโจทย์
            </li>
            <li>ไม่ได้อธิบายหลักเหตุผลที่ใช้ในการคิดแต่ละขั้นตอน </li>
          </ul>
          <li>
            <span className="text-red-500">3 คะแนน</span>
          </li>
          <ul>
            <li>
              มีการแสดงวิธีการคิดแก้ปัญหาแบบเป็นขั้นตอนได้ชัดเจนตามลำดับและสามารถอธิบายได้ว่าสามารถแยกกลุ่มเพื่อนออกมาได้อย่างไร
              แต่อาจไม่การันตีความถูกต้องในบางสถานการณ์
            </li>
            <li>
              ยังขาดการอธิบายเหตุผลของปัญหายิบย่อยเช่นคน 2
              คนที่แกล้งทำเป็นรู้จักทุกคน
            </li>
          </ul>
          <li>
            <span className="text-red-500">4 คะแนน</span>
          </li>
          <ul>
            <li>
              มีการแสดงวิธีการคิดแก้ปัญหาแบบเป็นขั้นตอนได้ชัดเจนตามลำดับและสามารถอธิบายได้ว่าสามารถแยกกลุ่มเพื่อนออกมาได้อย่างไร
              พร้อมทั้งการันตีความถูกต้อง
            </li>
            <li>อธิบายในทุกความเป็นไปได้และแสดงถึงความเข้าใจโจทย์ที่ชัดเจน</li>
          </ul>
        </ul>
        <li>
          ความถูกต้องของกระบวนการคิด{" "}
          <span className="text-red-500">( 4 คะแนน )</span>
        </li>
        <ul>
          <li>
            <span className="text-red-500">0 - 1 คะแนน</span>
          </li>
          <ul>
            <li>
              วิธีคิดไม่สามารถหาคำตอบได้หรืออาจให้คำตอบที่ผิดในกรณีส่วนใหญ่ตามวิธีที่เขียนมา
            </li>
          </ul>
          <li>
            <span className="text-red-500">2 - 3 คะแนน</span>
          </li>
          <ul>
            <li>
              คำตอบมีความไม่ชัดเจนในบางกรณี ( เป็นคำตอบที่ไม่ได้ถูก 100% เสมอไป)
            </li>
            <li>ขาดการพิสูจน์ว่าถูกต้องได้อย่างไร</li>
          </ul>
          <li>
            <span className="text-red-500">4 คะแนน</span>
          </li>
          <ul>
            <li>คำตอบถูกต้องทุกกรณี</li>
            <li>มีการให้เหตุผลในการพิสูจน์ความถูกต้อง</li>
          </ul>
        </ul>
      </ul>
    </div>
  );
}

export function WichakanCite2() {
  return (
    <div>
      <p className="text-base">
        ข้อย่อยที่ 2 <span className="text-red-500">( 4 คะแนน )</span>
      </p>
      <ul>
        <li>
          การวิเคราะห์ประสิทธิภาพของกระบวนการคิด{" "}
          <span className="text-red-500">( 2 คะแนน )</span>
        </li>
        <ul>
          <li>
            <span className="text-red-500">0 - 1 คะแนน</span>
          </li>
          <ul>
            <li>ไม่มีการอธิบายการทำงานจนจบว่าคิดอย่างไรบ้าง</li>
            <li>
              มีการบอกว่าในแต่ละเคสจะใช้การถามกี่ครั้งบ้างแต่ยังขาดรายละเอียดในการอธิบาย
            </li>
          </ul>
          <li>
            <span className="text-red-500">2 คะแนน</span>
          </li>
          <ul>
            <li>
              มีการให้เหตุผลในจำนวนรอบที่ใช้ที่ชัดเจนและวิเคราะห์ได้ถูกต้อง
            </li>
          </ul>
        </ul>
      </ul>
      <ul>
        <li>
          ความสอดคล้องในกระบวนการคิดกับข้อแรก{" "}
          <span className="text-red-500">( 2 คะแนน )</span>
        </li>
        <ul>
          <li>
            <span className="text-red-500">0 คะแนน</span>
          </li>
          <ul>
            <li>ไม่มีความสอดคล้องกับวิธีที่เขียนมาในข้อย่อยที่ 1 </li>
          </ul>
          <li>
            <span className="text-red-500">2 คะแนน</span>
          </li>
          <ul>
            <li>มีความสอดคล้องกับวิธีที่เขียนมาในข้อย่อยที่ 1</li>
          </ul>
        </ul>
      </ul>
    </div>
  );
}

export function WichakanCite3() {
  return (
    <div>
      <p className="text-base">
        ข้อย่อยที่ 3 <span className="text-red-500">( 3 คะแนน )</span>
      </p>
      <ul>
        <li>
          การให้เหตุผลและการดัดแปลง{" "}
          <span className="text-red-500">( 3 คะแนน )</span>
        </li>
        <ul>
          <li>
            <span className="text-red-500">0 - 1 คะแนน</span>
          </li>
          <ul>
            <li>การอธิบายไม่ชัดเจนในการดัดแปลงให้เข้ากับปัญหาใหม่ไม่ชัดเจน</li>
            <li>
              ไม่ได้พูดถึงการเปลี่ยนแปลงที่อาจเกิดขึ้นหลังมีการปรับจำนวนคน
            </li>
          </ul>
          <li>
            <span className="text-red-500">2 - 3 คะแนน</span>
          </li>
          <ul>
            <li>
              มีการอธิบายสิ่งที่เปลี่ยนแปลงที่อาจมีผลต่อวิธีคิดแบบเชิงเปรียบเทียบและเป็นขั้นตอน
            </li>
            <li>การพิสูจน์ด้วยการจำลองหรือว่าคำนวนเหมือนข้อย่อยที่ 2</li>
          </ul>
        </ul>
      </ul>
    </div>
  );
}
